mancorz98/ReservoirComputing-stm32h7-firmware/CM7/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32h7xx_hal_spi.h"
#include "usb_device.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "dac8568.h"
#include "image_coder.h"
#include "usbd_cdc.h"
#include "usbd_cdc_if.h"
#include <math.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define USB_BUFFLEN 256

/* DUAL_CORE_BOOT_SYNC_SEQUENCE: Define for dual core boot synchronization    */
/*                             demonstration code based on hardware semaphore */
/* This define is present in both CM7/CM4 projects                            */
/* To comment when developping/debugging on a single core                     */
#define DUAL_CORE_BOOT_SYNC_SEQUENCE

#if defined(DUAL_CORE_BOOT_SYNC_SEQUENCE)
#ifndef HSEM_ID_0
#define HSEM_ID_0 (0U) /* HW semaphore 0*/
#endif
#endif /* DUAL_CORE_BOOT_SYNC_SEQUENCE */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
#define ADC_NUM_CONVERSIONS 8
#define BUFF_MULTIPLY 8
#define IMAGE_SIZE 8
#define EXPECTED_PACKET_SIZE 71
#define READOUT_VOLTAGE_V 0.25f
#define READOUT_SAMPLES 150

#define APB_CLOCK_HZ 65000000U
#define TIMER8_FREQ_HZ 100000U // 100kHz ADC trigger
#define TIMER1_FREQ_HZ 4000U   // 1kHz DAC trigger

#define DAC_REF_VOLTAGE_V 2.5f
#define ADC_REF_VOLTAGE_V 3.3f
#define PULSE_AMPLITUDE_V 2.25f

#define DAC_PERIOD_S (1.0f / TIMER1_FREQ_HZ) // 0.001s = 1ms
#define SUPPLY_PERIOD_MS 1.0f                // 10ms

// Calculate compile-time constants
#define SUPPLY_PERIOD_S (SUPPLY_PERIOD_MS / 1000.0f) // 0.01s
#define TOTAL_SUPPLY_CYCLES                                                    \
  ((size_t)(TIMER1_FREQ_HZ * SUPPLY_PERIOD_S)) // 10 cycles
#define EXPECTED_SAMPLES_PER_ROW                                               \
  (IMAGE_SIZE * TOTAL_SUPPLY_CYCLES) // 100 samples

#define DAC_BATCH_SIZE 9 // 8 channel writes + 1 update command

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

COM_InitTypeDef BspCOMInit;
ADC_HandleTypeDef hadc2;
DMA_HandleTypeDef hdma_adc2;

SPI_HandleTypeDef hspi1;
DMA_HandleTypeDef hdma_spi1_tx;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim8;

/* USER CODE BEGIN PV */
uint8_t usbTxBuf[USB_BUFFLEN];
uint16_t usbTxBufLen;

uint8_t usbRxBuf[USB_BUFFLEN];
uint16_t usbRxBufLen;
uint8_t usbDataReceived = 0;
uint8_t imageReceived = 0;

uint8_t image_buffer[IMAGE_SIZE][IMAGE_SIZE];

// Accumulator for fragmented USB packets
volatile uint8_t accumulator[USB_BUFFLEN];
volatile uint16_t accum_len = 0;
volatile uint8_t packet_ready = 0;

// Debug counters
volatile uint32_t rx_callback_count = 0;
volatile uint32_t packets_processed = 0;

typedef enum {
  DAC_STATE_IDLE,
  DAC_STATE_SENDING_CHANNELS,
  DAC_STATE_SENDING_UPDATE,
  DAC_STATE_COMPLETE,
  DAC_STATE_WAITING_TIMER,
  DAC_STATE_BUSY,
  DAC_STATE_WRITE_COMPLETE, // ← New: Write phase done
  DAC_STATE_READOUT_INIT,   // ← New: Preparing readout
  DAC_STATE_READOUT_ACTIVE, // ← New: Reading ADC
  DAC_STATE_ZEROING,        //

} DAC_State_t;

volatile DAC_State_t dac_state = DAC_STATE_IDLE;
volatile uint8_t current_channel = 0;
volatile size_t current_pixel = 0;
volatile size_t total_pixels = 0;
volatile DACValueCommand *current_dac_values = NULL;

volatile uint32_t readout_sample_count = 0;
volatile uint8_t readout_complete = 0;

volatile uint8_t readout_pulse_channel = 0;
volatile uint8_t readout_pulse_complete = 0;
volatile uint8_t callback_count = 0;

// Channel lookup table
const uint8_t channels[8] = {CHANNEL_A, CHANNEL_B, CHANNEL_C, CHANNEL_D,
                             CHANNEL_E, CHANNEL_F, CHANNEL_G, CHANNEL_H};
const float adc_period = 1.0f / (float)TIMER8_FREQ_HZ;
const float dac_period = DAC_PERIOD_S;

static const float supply_period = SUPPLY_PERIOD_S;
static const size_t total_supply_cycles = TOTAL_SUPPLY_CYCLES;
static const size_t expected_samples_per_row = EXPECTED_SAMPLES_PER_ROW;
static DACValueCommand dac_values_timed[EXPECTED_SAMPLES_PER_ROW];

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
static void MX_DMA_Init(void);
static void MX_GPIO_Init(void);
static void MX_ADC2_Init(void);
static void MX_TIM8_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM3_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
volatile uint8_t dac_ready = 1; // ← CRITICAL: Add this!

__attribute__((section(
    ".adcarray"))) uint16_t ADC_VAL[ADC_NUM_CONVERSIONS * READOUT_SAMPLES];

__attribute__((
    section(".adcarray"))) uint32_t TX_batch_buffer[DAC_BATCH_SIZE] = {0};

/* Keep single-word buffer for non-batch operations (readout, zeroing) */
__attribute__((section(".adcarray"))) uint32_t TX_buffer[1] = {0};

/* DMA completion flag */
volatile uint8_t spi_dma_complete = 0;

volatile float value[ADC_NUM_CONVERSIONS];
int count = 0;

uint16_t get_channel_value(volatile DACValueCommand *dac_val, uint8_t ch) {
  switch (ch) {
  case 0:
    return dac_val->ch1;
  case 1:
    return dac_val->ch2;
  case 2:
    return dac_val->ch3;
  case 3:
    return dac_val->ch4;
  case 4:
    return dac_val->ch5;
  case 5:
    return dac_val->ch6;
  case 6:
    return dac_val->ch7;
  case 7:
    return dac_val->ch8;
  default:
    return 0;
  }
}

/**
 * @brief Fill TX_batch_buffer with 8 channel writes + 1 update command
 * @param dac_val Pointer to current pixel's DACValueCommand
 */
void Build_DAC_Batch(volatile DACValueCommand *dac_val) {
  DACcommand cmd;
  cmd.feature = FEATURE_NO_OPERATION;

  // 8 channel WRITE commands
  for (uint8_t ch = 0; ch < 8; ch++) {
    cmd.control = CMD_WRITE;
    cmd.channel = channels[ch];
    cmd.data = get_channel_value(dac_val, ch);
    TX_batch_buffer[ch] = set_command_word(&cmd);
  }

  // UPDATE ALL command (index 8)
  cmd.control = CMD_UPDATE;
  cmd.channel = CHANNEL_ALL;
  cmd.data = 0;
  TX_batch_buffer[8] = set_command_word(&cmd);
}

