mancorz98/ReservoirComputing-stm32h7-firmware/CM7/Core/Src/main.c
long map(long x, long in_min, long in_max, long out_min, long out_max) {
  // Clamp input to valid range
  if (x < in_min)
    return out_min;
  if (x > in_max)
    return out_max;

  // Use long long to prevent overflow during multiplication
  return (long)(((long long)(x - in_min) * (out_max - out_min)) /
                (in_max - in_min)) +
         out_min;
}

float mapf(long x, long in_min, long in_max, float out_min, float out_max) {
  // Clamp input to valid range
  if (x < in_min)
    return out_min;
  if (x > in_max)
    return out_max;

  // Calculate with float precision
  return (float)(x - in_min) * (out_max - out_min) / (in_max - in_min) +
         out_min;
}

void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi) {
  if (hspi != &hspi1)
    return;

  if (dac_state == DAC_STATE_READOUT_INIT) {
    // Readout pulse sent — start ADC sampling
    dac_state = DAC_STATE_READOUT_ACTIVE;
    __HAL_TIM_SET_COUNTER(&htim8, 0);
    __HAL_TIM_CLEAR_FLAG(&htim8, TIM_FLAG_UPDATE);
    HAL_TIM_Base_Start(&htim8);
  }
}

size_t create_csv_record(char *buffer, size_t buffer_size,
                         size_t num_decimals) {
  if (buffer_size == 0)
    return 0;

  size_t offset = 0;

  // Optimization: Pre-calculate multiplier to avoid pow() in loop
  int multiplier = 1;
  for (size_t k = 0; k < num_decimals; k++) {
    multiplier *= 10;
  }

  for (size_t i = 0; i < ADC_NUM_CONVERSIONS; i++) {
    float val = value[i];

    // 1. Handle Sign explicitly to fix the "-0.5" bug
    char sign = '\0';
    if (val < 0) {
      sign = '-';
      val = -val; // Make positive for calculation
    }

    // 2. Rounding and Integer/Frac split
    // Adding 0.5f before casting effects "rounding to nearest" rather than
    // truncation
    int whole = (int)val;
    int frac = (int)((val - whole) * multiplier + 0.5f);

    // Handle edge case: rounding rolls over (e.g., 1.999 -> 2.000)
    if (frac >= multiplier) {
      whole++;
      frac = 0;
    }

    // 3. Dynamic Format String Logic
    // We cannot use %03d because num_decimals varies.
    // We verify space exists for worst case (sign + whole + . + frac + comma)
    int written;

    // Note: '%.*d' allows dynamic width for the integer precision (padding
    // zeros)
    written = snprintf(
        buffer + offset, buffer_size - offset, "%c%d.%.*d",
        (sign ? sign : '\0'), // Hack to print sign only if needed (or nothing)
        whole, (int)num_decimals, frac);

    // Note: snprintf returns what it *would* have written.
    // We must check if it actually fit.
    if (written < 0 || (size_t)written >= buffer_size - offset) {
      // Buffer full or error
      buffer[buffer_size - 1] = '\0'; // Ensure termination
      return offset;
    }
    offset += written;

    // 4. Append Comma
    if (i < ADC_NUM_CONVERSIONS - 1) {
      if (offset + 1 < buffer_size) {
        buffer[offset++] = ',';
      } else {
        buffer[buffer_size - 1] = '\0';
        return offset;
      }
    }
  }

  // 5. Safe Line Termination (Checking for 3 chars: \r, \n, \0)
  if (offset + 2 < buffer_size) {
    buffer[offset++] = '\r';
    buffer[offset++] = '\n';
    buffer[offset] = '\0';
  } else {
    // Force null termination if we ran out of space for CRLF
    buffer[buffer_size - 1] = '\0';
  }

  return offset;
}

bool receive_image_8x8(uint8_t *buffer, uint16_t buffer_size,
                       uint8_t image_out[IMAGE_SIZE][IMAGE_SIZE]) {
  // Verify header
  if (buffer[0] != 0xAA || buffer[1] != 0x55) {
    return false;
  }

  // Parse dimensions (2 bytes each, little-endian)
  uint16_t h = buffer[2] | (buffer[3] << 8);
  uint16_t w = buffer[4] | (buffer[5] << 8);

  // Verify it's 8x8
  if (h != IMAGE_SIZE || w != IMAGE_SIZE) {
    return false;
  }

  // Check buffer size
  if (buffer_size < 71) {
    return false;
  }

  // Calculate checksum
  uint8_t calc_checksum = 0;
  for (uint8_t i = 0; i < 64; i++) {
    calc_checksum += buffer[6 + i];
  }

  if (calc_checksum != buffer[70]) {
    return false; // Checksum mismatch
  }

  // Copy image data (starts at byte 6)
  memcpy(image_out, &buffer[6], 64);

  return true;
}

float median_of_4(uint16_t a, uint16_t b, uint16_t c, uint16_t d) {
  // Sort 4 values and return average of middle two
  uint16_t arr[4] = {a, b, c, d};

  // Simple bubble sort for 4 elements
  for (int i = 0; i < 3; i++)
    for (int j = 0; j < 3 - i; j++)
      if (arr[j] > arr[j + 1]) {
        uint16_t temp = arr[j];
        arr[j] = arr[j + 1];
        arr[j + 1] = temp;
      }

  // Return median (average of middle two values)
  return ((arr[1] + arr[2]) / 2.0f) * ADC_REF_VOLTAGE_V / 65535.0f;
}

void Set_DAC_Outputs_Zero(void) {
  DACcommand cmd;
  cmd.control = CMD_WRITE_UPDATE_ALL;
  cmd.feature = FEATURE_NO_OPERATION;
  cmd.channel = CHANNEL_ALL;
  cmd.data = 0x0000; // 0V

  TX_buffer[0] = set_command_word(&cmd);

  // Use blocking transmission (called after readout complete)
  HAL_SPI_Transmit_DMA(&hspi1, (uint8_t *)TX_buffer, 1);
}

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc) {
  if (hadc != &hadc2)
    return;
  if (dac_state == DAC_STATE_READOUT_ACTIVE) {
    HAL_TIM_Base_Stop(&htim8);

    // Zero DAC - blocking
    DACcommand cmd;
    cmd.control = CMD_WRITE_UPDATE_ALL;
    cmd.channel = CHANNEL_ALL;
    cmd.data = 0x0000;
    TX_buffer[0] = set_command_word(&cmd);
    HAL_SPI_Transmit_DMA(&hspi1, (uint8_t *)TX_buffer, 1);

    dac_state = DAC_STATE_COMPLETE;
    readout_complete = 1;
  }
}

void Send_Readout_Pulse_Start(void) {
  // Reset state
  readout_pulse_channel = 0;
  readout_pulse_complete = 0;

  // Convert 0.15V to DAC value
  uint16_t readout_dac_value =
      (uint16_t)(READOUT_VOLTAGE_V / DAC_REF_VOLTAGE_V * 65535.0f);

  // Send first channel
  DACcommand cmd;
  cmd.control = CMD_WRITE;
  cmd.feature = FEATURE_NO_OPERATION;
  cmd.channel = channels[0];
  cmd.data = readout_dac_value;

  TX_buffer[0] = set_command_word(&cmd);
  HAL_SPI_Transmit_DMA(&hspi1, (uint8_t *)TX_buffer, 1);

  readout_pulse_channel++;
}

void Send_Readout_Pulse_Continue(void) {
  uint16_t readout_dac_value =
      (uint16_t)(READOUT_VOLTAGE_V / DAC_REF_VOLTAGE_V * 65535.0f);
  DACcommand cmd;

  if (readout_pulse_channel < 8) {
    // Send next channel
    cmd.control = CMD_WRITE;
    cmd.feature = FEATURE_NO_OPERATION;
    cmd.channel = channels[readout_pulse_channel];
    cmd.data = readout_dac_value;

    TX_buffer[0] = set_command_word(&cmd);
    HAL_SPI_Transmit_DMA(&hspi1, (uint8_t *)TX_buffer, 1);

    readout_pulse_channel++;

