mancorz98/ReservoirComputing-stm32h7-firmware/CM7/Core/Src/main.c
  } else if (readout_pulse_channel == 8) {
    // All channels sent, send UPDATE
    cmd.control = CMD_UPDATE;
    cmd.channel = CHANNEL_ALL;
    cmd.data = 0;

    TX_buffer[0] = set_command_word(&cmd);
    HAL_SPI_Transmit_DMA(&hspi1, (uint8_t *)TX_buffer, 1);

    readout_pulse_channel++;

  } else {
    // UPDATE sent, done
    readout_pulse_complete = 1;
  }
}
void Start_Readout_Phase(void) {
  readout_complete = 0;

  uint16_t readout_dac_value =
      (uint16_t)(READOUT_VOLTAGE_V / DAC_REF_VOLTAGE_V * 65535.0f);

  DACcommand cmd;
  cmd.feature = FEATURE_NO_OPERATION;

  for (uint8_t ch = 0; ch < 8; ch++) {
    cmd.control = CMD_WRITE;
    cmd.channel = channels[ch];
    cmd.data = readout_dac_value;
    TX_batch_buffer[ch] = set_command_word(&cmd);
  }

  cmd.control = CMD_UPDATE;
  cmd.channel = CHANNEL_ALL;
  cmd.data = 0;
  TX_batch_buffer[8] = set_command_word(&cmd);

  // Restart ADC DMA so buffer starts at index 0
  HAL_ADC_Stop_DMA(&hadc2);
  memset(ADC_VAL, 0, sizeof(ADC_VAL));
  HAL_ADC_Start_DMA(&hadc2, (uint32_t *)ADC_VAL,
                    ADC_NUM_CONVERSIONS * READOUT_SAMPLES);

  // Send via DMA — callback will start TIM8
  dac_state = DAC_STATE_READOUT_INIT;
  HAL_SPI_Transmit_DMA(&hspi1, (uint8_t *)TX_batch_buffer, DAC_BATCH_SIZE);
}

HAL_StatusTypeDef DAC_Start_Update(DACValueCommand *dac_values,
                                   size_t pixel_count) {
  // Check if already busy
  if (dac_state != DAC_STATE_IDLE && dac_state != DAC_STATE_COMPLETE) {
    return HAL_BUSY;
  }

  // Initialize state
  dac_state = DAC_STATE_SENDING_CHANNELS;
  current_channel = 0;
  current_pixel = 0;
  total_pixels = pixel_count;
  current_dac_values = dac_values;

  // Send first channel of first pixel
  DACcommand cmd;
  cmd.control = CMD_WRITE;
  cmd.feature = FEATURE_NO_OPERATION;
  cmd.channel = CHANNEL_A;
  cmd.data = get_channel_value(&dac_values[0], 0);
  TX_buffer[0] = set_command_word(&cmd);

  HAL_StatusTypeDef status =
      HAL_SPI_Transmit_DMA(&hspi1, (uint8_t *)TX_buffer, 1);

  if (status != HAL_OK) {
    dac_state = DAC_STATE_IDLE;
    return status;
  }

  current_channel++;

  return HAL_OK;
}
HAL_StatusTypeDef DAC_Start_Timer_Sequence(DACValueCommand *dac_values,
                                           size_t pixel_count) {
  if (dac_state != DAC_STATE_IDLE && dac_state != DAC_STATE_COMPLETE) {
    return HAL_BUSY;
  }

  dac_state = DAC_STATE_WAITING_TIMER;
  current_channel = 0;
  current_pixel = 0;
  total_pixels = pixel_count;
  current_dac_values = dac_values;

  // ✅ Reset counter to prevent immediate interrupt
  __HAL_TIM_SET_COUNTER(&htim1, 0);
  __HAL_TIM_CLEAR_FLAG(&htim1, TIM_FLAG_UPDATE);

  HAL_TIM_Base_Start_IT(&htim1);

  return HAL_OK;
}
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
  if (htim->Instance == TIM3) {
    __HAL_TIM_CLEAR_FLAG(htim, TIM_FLAG_UPDATE);
    return;
  }

  if (htim->Instance != TIM1)
    return;

  if (current_pixel < total_pixels) {
    // Build the 9-word batch for this pixel
    Build_DAC_Batch(&current_dac_values[current_pixel]);

    // Send all 9 words via single DMA transfer
    // NSSP mode auto-pulses CS between each 32-bit frame
    HAL_SPI_Transmit_DMA(&hspi1, (uint8_t *)TX_batch_buffer, DAC_BATCH_SIZE);

    current_pixel++;
  } else {
    // Programming done → start readout
    HAL_TIM_Base_Stop_IT(&htim1);
    dac_state = DAC_STATE_WRITE_COMPLETE;
    Start_Readout_Phase();
  }
}

void DAC_Stop_Timer_Sequence(void) {
  HAL_TIM_Base_Stop_IT(&htim1);
  dac_state = DAC_STATE_IDLE;
  current_pixel = 0;
}

uint8_t DAC_Is_Busy(void) {
  return (dac_state != DAC_STATE_IDLE && dac_state != DAC_STATE_COMPLETE);
}
uint32_t DAC_Get_Current_Pixel(void) { return current_pixel; }

float DAC_Get_Progress_Percent(void) {
  if (total_pixels == 0)
    return 0.0f;
  return ((float)current_pixel / (float)total_pixels) * 100.0f;
}
void DAC_Reset(void) {
  HAL_TIM_Base_Stop_IT(&htim1);
  HAL_TIM_Base_Stop(&htim8);
  // ❌ DON'T stop ADC - let it keep running

  dac_state = DAC_STATE_IDLE;
  current_channel = 0;
  current_pixel = 0;
  total_pixels = 0;
  current_dac_values = NULL;

  readout_complete = 0;
  readout_pulse_channel = 0;
  readout_pulse_complete = 0;
}

void USB_RXCallback(uint8_t *buf, uint32_t len) {
  rx_callback_count++;

  // Accumulate incoming data
  for (uint32_t i = 0; i < len && accum_len < USB_BUFFLEN; i++) {
    accumulator[accum_len++] = buf[i];
  }

  // Search for complete packet (71 bytes starting with 0xAA 0x55)
  if (accum_len >= EXPECTED_PACKET_SIZE) {
    for (uint16_t i = 0; i <= accum_len - EXPECTED_PACKET_SIZE; i++) {
      if (accumulator[i] == 0xAA && accumulator[i + 1] == 0x55) {
        // Found header! Copy complete packet
        memcpy(usbRxBuf, &accumulator[i], EXPECTED_PACKET_SIZE);
        usbRxBufLen = EXPECTED_PACKET_SIZE;
        packet_ready = 1;

        // Remove processed data from accumulator
        uint16_t remaining = accum_len - (i + EXPECTED_PACKET_SIZE);
        if (remaining > 0) {
          memmove((void *)accumulator, &accumulator[i + EXPECTED_PACKET_SIZE],
                  remaining);
          accum_len = remaining;
        } else {
          accum_len = 0;
        }

        break;
      }
    }

    // Prevent overflow - reset if no valid packet found
    if (accum_len >= USB_BUFFLEN - 64) {
      accum_len = 0;
    }
  }
}

void process_image(uint8_t image[IMAGE_SIZE][IMAGE_SIZE]) {
  static DACValueCommand
      dac_values[IMAGE_SIZE * 10]; // Static to avoid stack overflow
  size_t out_size = IMAGE_SIZE * TOTAL_SUPPLY_CYCLES; // 100ms

  // Generate waveforms for all rows
  for (size_t i = 0; i < IMAGE_SIZE; i++) {
    uint16_t *dac_waveform = generate_dac_waveform(
        image[i], IMAGE_SIZE, DAC_REF_VOLTAGE_V, PULSE_AMPLITUDE_V,
        TIMER1_FREQ_HZ, supply_period, 0.5f, &out_size);

