mancorz98/ReservoirComputing-stm32h7-firmware/CM7/Core/Src/main.c
    for (size_t j = 0; j < out_size; j++) {
      switch (i) {
      case 0:
        dac_values[j].ch1 = dac_waveform[j];
        break;
      case 1:
        dac_values[j].ch2 = dac_waveform[j];
        break;
      case 2:
        dac_values[j].ch3 = dac_waveform[j];
        break;
      case 3:
        dac_values[j].ch4 = dac_waveform[j];
        break;
      case 4:
        dac_values[j].ch5 = dac_waveform[j];
        break;
      case 5:
        dac_values[j].ch6 = dac_waveform[j];
        break;
      case 6:
        dac_values[j].ch7 = dac_waveform[j];
        break;
      case 7:
        dac_values[j].ch8 = dac_waveform[j];
        break;
      }
    }
    free(dac_waveform);
  }

  // Start non-blocking DAC update
  if (DAC_Start_Update(dac_values, out_size) != HAL_OK) {
    // Handle error
    Error_Handler();
  }

  // Function returns immediately!
  // DMA callback will handle everything
}
void process_image_timed(uint8_t image[IMAGE_SIZE][IMAGE_SIZE]) {
  // ✅ Use the file-scope buffer instead of local static
  size_t out_size = EXPECTED_SAMPLES_PER_ROW;

  // Generate waveforms for all rows
  for (size_t row = 0; row < IMAGE_SIZE; row++) {
    size_t actual_samples = out_size;

    uint16_t *dac_waveform = generate_dac_waveform(
        image[row], IMAGE_SIZE, DAC_REF_VOLTAGE_V, PULSE_AMPLITUDE_V,
        TIMER1_FREQ_HZ, supply_period, 0.5f, &actual_samples);

    if (dac_waveform == NULL) {
      Error_Handler();
      return;
    }

    if (actual_samples > EXPECTED_SAMPLES_PER_ROW) {
      free(dac_waveform);
      Error_Handler();
      return;
    }

    if (row == 0) {
      out_size = actual_samples;
    }

    // Direct pointer to the channel for this row
    uint16_t *channel_base = ((uint16_t *)dac_values_timed) + row;

    for (size_t j = 0; j < actual_samples; j++) {
      channel_base[j * 8] = dac_waveform[j];
    }

    free(dac_waveform);
  }

  readout_complete = 0;
  HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_1);
  __HAL_TIM_SET_COUNTER(&htim3, 0);
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
  HAL_Delay(10); // 10ms — safely past the 1ms active pulse

  if (DAC_Start_Timer_Sequence(dac_values_timed, out_size) != HAL_OK) {
    Error_Handler();
  }
}

void process_usb_packet(void) {
  if (!packet_ready) {
    return;
  }

  // ✅ Check if system is already busy
  if (DAC_Is_Busy()) {
    // System busy, can't process new packet yet
    // Keep packet_ready flag set for retry
    return;
  }

  packet_ready = 0;
  packets_processed++;

  if (receive_image_8x8(usbRxBuf, usbRxBufLen, image_buffer)) {
    uint8_t ack = 0x06;
    CDC_Transmit_FS(&ack, 1);

    // Safe to start - we checked DAC_Is_Busy() above
    process_image_timed(image_buffer);

  } else {
    uint8_t nack = 0x15;
    CDC_Transmit_FS(&nack, 1);

    DAC_Reset(); // Clean up state
  }
}

void Process_Readout_Data(void) {
  // Average all samples per channel in scan mode
  for (uint8_t ch = 0; ch < ADC_NUM_CONVERSIONS; ch++) {
    float sum_channel = 0.0f;

    // In scan mode: data is [CH0,CH1,...,CH7, CH0,CH1,...,CH7, ...]
    for (uint32_t sample = 0; sample < READOUT_SAMPLES; sample++) {
      // ✅ Your original indexing was correct!
      uint16_t adc_raw = ADC_VAL[ch + sample * ADC_NUM_CONVERSIONS];
      sum_channel += (adc_raw * ADC_REF_VOLTAGE_V) / 65535.0f;
    }

    value[ch] = sum_channel / (float)READOUT_SAMPLES;
  }

  // Create and send CSV record
  usbTxBufLen = create_csv_record((char *)usbTxBuf, USB_BUFFLEN, 4);
  CDC_Transmit_FS(usbTxBuf, usbTxBufLen);
}
/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */
/* USER CODE BEGIN Boot_Mode_Sequence_0 */
#if defined(DUAL_CORE_BOOT_SYNC_SEQUENCE)
  int32_t timeout;
#endif /* DUAL_CORE_BOOT_SYNC_SEQUENCE */
       /* USER CODE END Boot_Mode_Sequence_0 */

  /* MPU Configuration--------------------------------------------------------*/

  MPU_Config();

  /* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

/* USER CODE BEGIN Boot_Mode_Sequence_1 */
#if defined(DUAL_CORE_BOOT_SYNC_SEQUENCE)
  /* Wait until CPU2 boots and enters in stop mode or timeout*/
  timeout = 0xFFFF;
  while ((__HAL_RCC_GET_FLAG(RCC_FLAG_D2CKRDY) != RESET) && (timeout-- > 0))
    ;
  if (timeout < 0) {
    Error_Handler();
  }
#endif /* DUAL_CORE_BOOT_SYNC_SEQUENCE */
       /* USER CODE END Boot_Mode_Sequence_1 */
  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick.
   */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();
/* USER CODE BEGIN Boot_Mode_Sequence_2 */
#if defined(DUAL_CORE_BOOT_SYNC_SEQUENCE)
  /* When system initialization is finished, Cortex-M7 will release Cortex-M4
  by means of HSEM notification */
  /*HW semaphore Clock enable*/
  __HAL_RCC_HSEM_CLK_ENABLE();
  /*Take HSEM */
  HAL_HSEM_FastTake(HSEM_ID_0);
  /*Release HSEM in order to notify the CPU2(CM4)*/
  HAL_HSEM_Release(HSEM_ID_0, 0);
  /* wait until CPU2 wakes up from stop mode */
  timeout = 0xFFFF;
  while ((__HAL_RCC_GET_FLAG(RCC_FLAG_D2CKRDY) == RESET) && (timeout-- > 0))
    ;
  if (timeout < 0) {
    Error_Handler();
  }
#endif /* DUAL_CORE_BOOT_SYNC_SEQUENCE */
       /* USER CODE END Boot_Mode_Sequence_2 */

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_DMA_Init();
  MX_GPIO_Init();
  MX_ADC2_Init();
  MX_TIM8_Init();
  MX_SPI1_Init();
  MX_TIM1_Init();
  MX_TIM3_Init();
  MX_USB_DEVICE_Init();
  /* USER CODE BEGIN 2 */
  // HAL_SYSCFG_EnableVREFBUF();

  // HAL_ADCEx_Calibration_Start(&hadc2, ADC_CALIB_OFFSET_LINEARITY,
  //                             ADC_SINGLE_ENDED);

