mancorz98/ReservoirComputing-stm32h7-firmware/CM7/Core/Src/main.c
  // // while (HAL_ADCEx_Calibration_GetValue(&hadc2, ADC_SINGLE_ENDED) !=
  // HAL_OK)
  // //   ;

  // HAL_ADCEx_Calibration_Start(&hadc2, ADC_CALIB_FACTOR_LINEARITY_REGOFFSET,
  //                             ADC_SINGLE_ENDED);

  // HAL_ADCEx_Calibration_Start(&hadc2, ADC_CALIB_FACTOR_OFFSET_REGOFFSET,
  //                             ADC_SINGLE_ENDED);

  // if (HAL_OK == HAL_ADCEx_Calibration_Start(&hadc2,
  // ADC_CALIB_OFFSET_LINEARITY,
  //                                           ADC_SINGLE_ENDED)) {
  //   uint32_t calibFactor =
  //       HAL_ADCEx_Calibration_GetValue(&hadc2, ADC_SINGLE_ENDED);
  //   HAL_ADCEx_Calibration_SetValue(&hadc2, ADC_SINGLE_ENDED, calibFactor);
  // }

  // HAL_ADC_Start_DMA(&hadc2, (uint32_t *)ADC_VAL,
  //                   ADC_NUM_CONVERSIONS * READOUT_SAMPLES);

  // 1. Run the most comprehensive calibration (Offset + Linearity)
  // We wrap it in an if statement to catch hardware failures
  if (HAL_ADCEx_Calibration_Start(&hadc2, ADC_CALIB_OFFSET_LINEARITY,
                                  ADC_SINGLE_ENDED) != HAL_OK) {
    // Calibration failed. Insert your error handling here.
    Error_Handler();
  }

  // 2. Start the ADC in DMA mode
  if (HAL_ADC_Start_DMA(&hadc2, (uint32_t *)ADC_VAL,
                        ADC_NUM_CONVERSIONS * READOUT_SAMPLES) != HAL_OK) {
    // DMA Start failed. Insert your error handling here.
    Error_Handler();
  }

  // HAL_TIM_Base_Start_IT(&htim8); // Start timer for ADC triggering

  /* USER CODE END 2 */

  /* Initialize leds */
  BSP_LED_Init(LED_GREEN);
  BSP_LED_Init(LED_YELLOW);
  BSP_LED_Init(LED_RED);

  /* Initialize USER push-button, will be used to trigger an interrupt each time
   * it's pressed.*/
  BSP_PB_Init(BUTTON_USER, BUTTON_MODE_EXTI);

  /* Initialize COM1 port (115200, 8 bits (7-bit data + 1 stop bit), no parity
   */
  BspCOMInit.BaudRate = 115200;
  BspCOMInit.WordLength = COM_WORDLENGTH_8B;
  BspCOMInit.StopBits = COM_STOPBITS_1;
  BspCOMInit.Parity = COM_PARITY_NONE;
  BspCOMInit.HwFlowCtl = COM_HWCONTROL_NONE;
  if (BSP_COM_Init(COM1, &BspCOMInit) != BSP_ERROR_NONE) {
    Error_Handler();
  }

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  // Disable internal reference (use internal 2V)
  TX_buffer[0] = 0x07000000;
  HAL_SPI_Transmit(&hspi1, (uint8_t *)TX_buffer, 1, 100); // CS automatic!
  HAL_Delay(1);

  // Enable flexible mode (optional)
  TX_buffer[0] = 0x090A0000;
  HAL_SPI_Transmit(&hspi1, (uint8_t *)TX_buffer, 1, 100); // CS automatic!
  HAL_Delay(10);

  DACcommand cmd;
  cmd.control = CMD_WRITE_UPDATE_ALL;
  cmd.feature = FEATURE_NO_OPERATION;
  cmd.channel = CHANNEL_ALL;
  cmd.data = 0x0; // Set all channels to midscale
  TX_buffer[0] = set_command_word(&cmd);
  HAL_SPI_Transmit_DMA(&hspi1, (uint8_t *)TX_buffer, 1);
  HAL_Delay(10);

  __NOP();
  while (1) {

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
    process_usb_packet();
    // Wait for complete cycle (write + readout)
    if (readout_complete) {
      // Can do other work here
      readout_complete = 0;
      Process_Readout_Data();
      DAC_Reset();
      // DAC_Reset();
    }

    // Process readout data
  }

  /* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void) {
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Supply configuration update enable
   */
  HAL_PWREx_ConfigSupply(PWR_DIRECT_SMPS_SUPPLY);

  /** Configure the main internal regulator output voltage
   */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE3);

  while (!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {
  }

  /** Initializes the RCC Oscillators according to the specified parameters
   * in the RCC_OscInitTypeDef structure.
   */
  RCC_OscInitStruct.OscillatorType =
      RCC_OSCILLATORTYPE_HSI48 | RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_DIV1;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.HSI48State = RCC_HSI48_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 10;
  RCC_OscInitStruct.PLL.PLLP = 2;
  RCC_OscInitStruct.PLL.PLLQ = 2;
  RCC_OscInitStruct.PLL.PLLR = 2;
  RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_3;
  RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOMEDIUM;
  RCC_OscInitStruct.PLL.PLLFRACN = 0;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
   */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2 |
                                RCC_CLOCKTYPE_D3PCLK1 | RCC_CLOCKTYPE_D1PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV1;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK) {
    Error_Handler();
  }
}

/**
 * @brief ADC2 Initialization Function
 * @param None
 * @retval None
 */
static void MX_ADC2_Init(void) {

  /* USER CODE BEGIN ADC2_Init 0 */

  /* USER CODE END ADC2_Init 0 */

  ADC_ChannelConfTypeDef sConfig = {0};

  /* USER CODE BEGIN ADC2_Init 1 */

  /* USER CODE END ADC2_Init 1 */

  /** Common config
   */
  hadc2.Instance = ADC2;
  hadc2.Init.ClockPrescaler = ADC_CLOCK_ASYNC_DIV2;
  hadc2.Init.Resolution = ADC_RESOLUTION_16B;
  hadc2.Init.ScanConvMode = ADC_SCAN_ENABLE;
  hadc2.Init.EOCSelection = ADC_EOC_SEQ_CONV;
  hadc2.Init.LowPowerAutoWait = DISABLE;
  hadc2.Init.ContinuousConvMode = DISABLE;
  hadc2.Init.NbrOfConversion = 8;
  hadc2.Init.DiscontinuousConvMode = DISABLE;
  hadc2.Init.ExternalTrigConv = ADC_EXTERNALTRIG_T8_TRGO;
  hadc2.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISING;
  hadc2.Init.ConversionDataManagement = ADC_CONVERSIONDATA_DMA_CIRCULAR;
  hadc2.Init.Overrun = ADC_OVR_DATA_OVERWRITTEN;
  hadc2.Init.LeftBitShift = ADC_LEFTBITSHIFT_NONE;
  hadc2.Init.OversamplingMode = DISABLE;
  hadc2.Init.Oversampling.Ratio = 1;
  if (HAL_ADC_Init(&hadc2) != HAL_OK) {
    Error_Handler();
  }

